## pandas tutorial

In [62]:
import pandas as pd

In [63]:
import numpy as np

In [7]:
l1=['a','b','c']

In [8]:
ser=pd.Series(l1)
ser

0    a
1    b
2    c
dtype: object

In [9]:
lstMul=l1*2
lstMul

['a', 'b', 'c', 'a', 'b', 'c']

In [10]:
serMul=ser*2
serMul

0    aa
1    bb
2    cc
dtype: object

In [11]:
l2=[21,22,23]
ser2=pd.Series(l1,index=l2)
ser2

21    a
22    b
23    c
dtype: object

In [12]:
score1=[9,10,8]
score2=[10,10,9]
score1Ser=pd.Series(score1,['Math','sci','eng'])
score2Ser=pd.Series(score2,['Math','eng','sci'])
print(score1Ser)
print(score2Ser)

Math     9
sci     10
eng      8
dtype: int64
Math    10
eng     10
sci      9
dtype: int64

In [13]:
score1Ser+score2Ser

Math    19
eng     18
sci     19
dtype: int64

In [14]:
score1=[9,10,8]
score2=[10,10,9]
score1Ser=pd.Series(score1,['Math','sci','eng'])
score2Ser=pd.Series(score2,['Math','eng','geo']) #change sci to geo
score1Ser+score2Ser #now the o/p shows NAN because sci does not match with geo

Math    19.0
eng     18.0
geo      NaN
sci      NaN
dtype: float64

In [15]:
arr=np.array(l1)
pd.Series(arr)

0    a
1    b
2    c
dtype: object

In [16]:
emp={'name':['ram','sham','komal','arushi'],'age':[21,22,19,20]}
emp

{'name': ['ram', 'sham', 'komal', 'arushi'], 'age': [21, 22, 19, 20]}

In [17]:
emp_df=pd.DataFrame(emp)
emp_df

     name  age
0     ram   21
1    sham   22
2   komal   19
3  arushi   20

In [18]:
emp_df.shape

(4, 2)

In [19]:
emp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
name    4 non-null object
age     4 non-null int64
dtypes: int64(1), object(1)
memory usage: 144.0+ bytes

In [20]:
type(emp_df) #to check type of object

pandas.core.frame.DataFrame

In [24]:
emp_df.head(2) #slicing - fetch desired number of records

   name  age
0   ram   21
1  sham   22

In [23]:
emp_df.tail(2) #slicing

     name  age
2   komal   19
3  arushi   20

In [25]:
emp_df.head() # if arguments are not given, it fetches 5 records by default

     name  age
0     ram   21
1    sham   22
2   komal   19
3  arushi   20

In [29]:
emp_df.loc[1:3] #accessing records by index values

     name  age
1    sham   22
2   komal   19
3  arushi   20

In [36]:
# we can get rid of redundant data by merging
df1=pd.DataFrame({'emp':[10,14,16,17],'projects':[2,4,5,7],'revenue':[10,20,45,80]})
df2=pd.DataFrame({'emp':[10,14,16,17],'projects':[2,4,5,7],'revenue':[20,20,45,80]})
merging=pd.merge(df1,df2)
merging

   emp  projects  revenue
0   14         4       20
1   16         5       45
2   17         7       80

In [46]:
# we can get rid of redundant data by merging
df1=pd.DataFrame({'emp':[10,14,16,17],'projects':[2,4,5,7],'revenue':[10,20,45,80]})
df2=pd.DataFrame({'emp':[10,14,16,17],'projects':[2,4,5,7],'revenue':[20,20,45,80]})
merging=pd.merge(df1,df2,on=['emp','projects'])
merging

   emp  projects  revenue_x  revenue_y
0   10         2         10         20
1   14         4         20         20
2   16         5         45         45
3   17         7         80         80

In [56]:
# we can join two dataframes
df1=pd.DataFrame({'emp':[10,11,12,13],'projects':[2,4,2,1]},index=[2001,2002,2003,2004])
df2=pd.DataFrame({'salary':[10,11,12,11],'revenue':[11,13,20,30]},index=[2001,2002,2004,2005])
joined=df1.join(df2) #left join
joined

      emp  projects  salary  revenue
2001   10         2    10.0     11.0
2002   11         4    11.0     13.0
2003   12         2     NaN      NaN
2004   13         1    12.0     20.0

In [57]:
# we can join two dataframes
df1=pd.DataFrame({'emp':[10,11,12,13],'projects':[2,4,2,1]},index=[2001,2002,2003,2004])
df2=pd.DataFrame({'salary':[10,11,12,11],'revenue':[11,13,20,30]},index=[2001,2002,2004,2005])
joined=df2.join(df1) #right join
joined

      salary  revenue   emp  projects
2001      10       11  10.0       2.0
2002      11       13  11.0       4.0
2004      12       20  13.0       1.0
2005      11       30   NaN       NaN

In [76]:
# changing index
df1=pd.DataFrame({'emp':[10,11,12,13],'projects':[2,4,2,1]})
newIdx=df1.set_index('emp')
newIdx

     projects
emp
10          2
11          4
12          2
13          1

In [73]:
df1 #observe the original data is not altered

   emp  projects
0   10         2
1   11         4
2   12         2
3   13         1

In [77]:
df1.set_index('emp',inplace=True)#to globally change the index
df1

     projects
emp
10          2
11          4
12          2
13          1

In [9]:
# concatenation
df1=pd.DataFrame({'emp':[10,11,12,13],'projects':[2,4,2,1]},index=[2001,2002,2003,2004])
df2=pd.DataFrame({'emp':[10,11,12,11],'projects':[11,13,20,30]},index=[2005,2006,2007,2008])
concatenate=pd.concat([df1,df2])
concatenate

      emp  projects
2001   10         2
2002   11         4
2003   12         2
2004   13         1
2005   10        11
2006   11        13
2007   12        20
2008   11        30

In [88]:
data=pd.read_excel('E:\\important notes and lectures\\python\\INVENTATEQ\\datascience\\datasets\\googleplaystore.xlsx','play')
data.head()

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite â€“ FREE Live Cool Themes, Hid...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up

In [76]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10841 entries, 0 to 10840
Data columns (total 13 columns):
App               10841 non-null object
Category          10841 non-null object
Rating            9367 non-null float64
Reviews           10841 non-null object
Size              10841 non-null object
Installs          10841 non-null object
Type              10840 non-null object
Price             10841 non-null object
Content Rating    10840 non-null object
Genres            10841 non-null object
Last Updated      10841 non-null object
Current Ver       10833 non-null object
Android Ver       10838 non-null object
dtypes: float64(1), object(12)
memory usage: 1.1+ MB

In [82]:
# Data munging - converting data from one format to another
html=data.to_html('play.html')# general syntax- but if this gives error try the one preset in the next code block

UnicodeEncodeError: 'charmap' codec can't encode character '\x90' in position 122873: character maps to <undefined>

In [86]:
# Data munging - converting data from one format to another
html=data.to_html()
file=open("play2.html","w",encoding="utf-8")
file.write(html)

3853209

In [ ]:
data.shape

## assignment: read car data in uci repository